let TVMConfigAssess = DeviceTvmSecureConfigurationAssessment
    | where ConfigurationSubcategory == 'Antivirus'
    | where ConfigurationId == "scid-2012"
    | where IsCompliant == "0";
DeviceTvmSoftwareInventoryVulnerabilities
| where SoftwareVendor == "symantec"
| where SoftwareName == "endpoint_protection"
| project DeviceName, OSPlatform, SoftwareVendor, SoftwareName, SoftwareVersion
| join kind= inner TVMConfigAssess on DeviceName
| project DeviceName, IsCompliant, SoftwareVendor, SoftwareName, SoftwareVersion 
| distinct DeviceName, IsCompliant, SoftwareVendor, SoftwareName, SoftwareVersion 
| sort by DeviceName asc